In [1]:
import pandas as pd
import numpy as np
Df=pd.DataFrame({'Name':['JHH&%^','HGFVHG&^GJ','$%^&FGH','jh hj',np.nan,''],'marks':['24^','%$245','2^&2','2 2 2','',np.nan]})

In [5]:
Df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 2 columns):
Name     5 non-null object
marks    5 non-null object
dtypes: object(2)
memory usage: 176.0+ bytes

In [2]:
Df

         Name  marks
0      JHH&%^    24^
1  HGFVHG&^GJ  %$245
2     $%^&FGH   2^&2
3       jh hj  2 2 2
4         NaN
5                NaN

In [3]:
Df.isnull().sum()

Name     1
marks    1
dtype: int64

In [4]:
Df['Name']=Df['Name'].str.replace('[^A-Z\sa-z0-9]+','')
Df['marks']=Df['marks'].str.replace('[^A-Za-z0-9\s]+','')

In [18]:
Df.isnull().sum()

Name     2
marks    2
dtype: int64

In [19]:
Df['Name']=Df['Name'].replace('',np.nan)
Df['marks']=Df['marks'].replace('',np.nan)

In [21]:
clean(Df)

       Name marks
0       JHH    24
1  HGFVHGGJ   245
2       FGH    22
3     jh hj   222
4       NaN   NaN
5       NaN   NaN

In [22]:
Df.isnull().sum()

Name     2
marks    2
dtype: int64

In [23]:
Df['marks']=Df['marks'].replace(np.nan,Df['marks'].median())

In [24]:
Df

       Name marks
0       JHH    24
1  HGFVHGGJ   245
2       FGH    22
3     jh hj   222
4       NaN   123
5       NaN   123